# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'buo/cask-upgrade'


# Utilities
brew 'coreutils'          # Mac OS Coreutils is Outdated
brew 'ffmpeg'             # Video Manipulation
brew 'figlet'             # Text to Ascii Art
brew 'git'                # Git Version Control
brew 'httpie'             # Rest Http Request Sender
brew 'hub'                # Improved Github Commands
brew 'm-cli'              # Mac OS Cli Tool
brew 'mackup'             # App OS Configuration Backup Tool
brew 'nmap'               # Network Tools
brew 'rename'             # Renaming Tool
brew 'tree'               # Show Directory as Tree
brew 'wifi-password'      # Show Password of Current Wifi
brew 'youtube-dl'         # Download Youtube Vid
brew 'mas'                # Mac App Store Manager
brew 'nano'               # Console Text Editor
brew 'brew-php-switcher'  # Tool to easily switch PHP versions

# Image Tools
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'
brew 'imagemagick'

# Development
brew 'php@7.4', link: false
brew 'php@7.2', link: false
brew 'php@7.3', restart_service: true, link: true
brew 'composer'
brew 'mariadb'
brew 'redis'
brew 'nginx'
brew 'dnsmasq'

# Apps
cask '1password'            # Password Manager
cask 'adobe-creative-cloud' # Adobe Tools
cask 'alfred'               # Task Runner
cask 'appcleaner'           # Clean Apps
cask 'bartender'            # Organize MacOS Bar
cask 'beamer'               # Stream to AppleTV
cask 'ccleaner'             # System Cleaner
cask 'colorsnapper'         # Pick Colors on screen
cask 'daisydisk'            # Analyze Disk usage
cask 'dash'                 # Dev Docs
cask 'dropbox'              # File Cloud
cask 'firefox'              # Browser
cask 'flash-player'         # Stupid old flash
cask 'google-chrome'        # Browser
cask 'harvest'              # Time tracking
cask 'imageoptim'           # Image Optimization
cask 'istat-menus'          # CPU & RAM Usage etc
cask 'iterm2'               # Terminal
cask 'java'                 # Java Environment
cask 'kap'                  # Screen Capture
cask 'microsoft-excel'      # MS Office Excel
cask 'microsoft-word'       # MS Office Word
cask 'namechanger'          # Bulk renaming utility
cask 'postman'              # API Request Tool
cask 'protonmail-bridge'    # ProtonMail Client Bridge
cask 'protonvpn'            # Proton VPN client
cask 'recordit'             # Quick Screen capture
cask 'sequel-pro'           # DB managment
cask 'signal'               # Messenger
cask 'sketch'               # Design App
cask 'skype'                # Communication
cask 'slack'                # Communication
cask 'sound-control'        # Control Sound Output
cask 'sourcetree'           # Git UI
cask 'spectacle'            # Window management with keys
cask 'spotify'              # Sound App
cask 'standard-notes'       # Privacy Notes App 
cask 'sublime-text'         # Coding editor
cask 'teamviewer'           # Remote control
cask 'telegram-desktop'     # Messenger
cask 'the-unarchiver'       # Zipfile tool
cask 'tinkerwell'           # PHP Live Editor
cask 'tor-browser'          # Deep Web Browser
cask 'transmission'         # Torrent Tool
cask 'transmit'             # FTP Client
cask 'visual-studio-code'   # Coding Editor
cask 'vlc'                  # Video Player
cask 'whatsapp'             # Messenger
cask 'zwift'                # VR cycling

# Quicklook
cask 'qlcolorcode'          # For colored code
cask 'qlmarkdown'           # For markdown files
cask 'quicklook-json'       # For JSON files
cask 'quicklook-csv'        # For CSV files
cask 'qlstephen'            # For plain files

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-fira-code'
cask 'font-arvo'
cask 'font-chivo'

# Mac App Store
mas 'Giphy Capture', id: 668208984
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Spark', id: 1176895641
mas 'Memory Diag', id: 748212890
