# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'


# Utilities
brew 'coreutils'          # macOS coreutils is outdated
brew 'ffmpeg'             # video manipulation
brew 'figlet'             # text to ascii art
brew 'git'                # git version control
brew 'httpie'             # rest http request sender
brew 'hub'                # improved github commands
brew 'm-cli'              # macOS cli tool
brew 'mackup'             # app & os configuration backup tool
brew 'nmap'               # network tools
brew 'rename'             # renaming tool
brew 'tree'               # show directory as tree
brew 'wifi-password'      # show password of current wifi
brew 'youtube-dl'         # download youtube vid
brew 'mas'                # mac App Store manager
brew 'cu'                 # brew Cask Updater

# Image Tools
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'
brew 'imagemagick'


# Development
brew 'php'
brew 'php@7.3'
brew 'php@7.2'
brew 'composer'
brew 'mariadb'
brew 'redis'

# Apps
cask '1password'            # Password Manager
cask 'alfred'               # Task Runner
cask 'appcleaner'           # Clean Apps
cask 'bartender'            # Organize MacOS Bar
cask 'beamer'               # Stream to AppleTV
cask 'colorsnapper'         # Pick Colors on screen
cask 'adobe-creative-cloud' # Adobe Tools
cask 'sound-control'        # Control Sound Output
cask 'firefox'              # Browser
cask 'google-chrome'        # Browser
cask 'imageoptim'           # Image Optimization
cask 'java'                 # Java Environment
cask 'daisydisk'            # Analyze Disk usage
cask 'dash'                 # Dev Docs
cask 'dropbox'              # File Cloud
cask 'flash-player          # Stupid old flash
cask 'harvest               # Time tracking
cask 'istat-menus           # CPU & RAM Usage etc
cask 'iterm2                # Terminal
cask 'kap                   # Screen Capture
cask 'microsoft-excel'      # MS Office Excel
cask 'microsoft-word'       # MS Office Word
cask 'namechanger'          # Bulk renaming utility
cask 'protonmail-bridge'    # ProtonMail Client Bridge
cask 'protonvpn'	    # Proton VPN client
cask 'recordit'             # Quick Screen capture
cask 'sequel-pro'           # DB managment
cask 'skype'                # Communication
cask 'sonos'                # Speaker control
cask 'spectacle'            # Window management with keys
cask 'spotify'              # Sound App
cask 'standard-notes'       # Privacy Notes App 
cask 'teamviewer'           # Remote control
cask 'whatsapp'             # Messenger
cask 'slack'                # Communication
cask 'sublime-text'         # Coding editor
cask 'telegram-desktop'     # Messenger
cask 'the-unarchiver'       # Zipfile tool
cask 'tinkerwell'           # PHP Live Editor
cask 'tor-browser'          # Deep Web Browser
cask 'transmission'         # Torrent Tool
cask 'transmit'             # FTP Client
cask 'visual-studio-code'   # Coding Editor
cask 'vlc'                  # Video Player
cask 'whatsapp'             # Messenger
cask 'postman'              # API Request Tool
cask 'sketch'               # Design App
cask 'sourcetree'           # Git UI

# Quicklook
cask 'qlcolorcode'          # For colored code
cask 'qlmarkdown'           # For markdown files
cask 'quicklook-json'       # For JSON files
cask 'quicklook-csv'        # For CSV files
cask 'qlstephen'            # For plain files

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-fira-code'
cask 'font-arvo'
cask 'font-chivo'

# Mac App Store
mas 'Giphy Capture', id: 668208984
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Spark', id: 1176895641
mas 'Memory Clean 2', id: 1114591412
